Examinator/src/Catalogs/ФайлыСУЗ/ФайлыСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФайлыСУЗ</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.РесурсыСУЗ</owners>
  <attributes>
    <name>FlashВерсия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FlashЦветФона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Версия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Выравнивать</name>
    <type>
      <types>EnumRef.СпособыВыравниванияСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОткрыватьПоСсылке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрыватьВнешнимПриложением</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Скрывать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипФайла</name>
    <type>
      <types>EnumRef.ТипыФайловСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроигрыватьАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнийФайл</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрыватьОбработкуМодально</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрыватьОбработкуБезопасно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонДокумента</name>
    <type>
      <types>CatalogRef.ШаблоныДокументовСУЗ</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/InformationRegisters/ДанныеФайлыСУЗ/ДанныеФайлыСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеФайлыСУЗ</name>
  <resources>
    <name>ПрисоединенныйФайл</name>
    <type>
      <types>CatalogRef.ФайлыСУЗПрисоединенныеФайлы</types>
    </type>
  </resources>
  <resources>
    <name>ТекстовыеДанные</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ДвоичныеДанные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеОбмена</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>РасширениеФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>СсылкаНаОбъектСУЗ</name>
    <type>
      <types>CatalogRef.ФайлыСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Версия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/ТипыОбъектовСУЗ/ТипыОбъектовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОбъектовСУЗ</name>
  <enumValues>
    <name>collection</name>
  </enumValues>
  <enumValues>
    <name>file</name>
  </enumValues>
  <enumValues>
    <name>frame</name>
  </enumValues>
  <enumValues>
    <name>glossary</name>
  </enumValues>
  <enumValues>
    <name>knowledgeBase</name>
  </enumValues>
  <enumValues>
    <name>map</name>
  </enumValues>
  <enumValues>
    <name>page</name>
  </enumValues>
  <enumValues>
    <name>question</name>
  </enumValues>
  <enumValues>
    <name>res</name>
  </enumValues>
  <enumValues>
    <name>term</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ТипыФайловСУЗ/ТипыФайловСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыФайловСУЗ</name>
  <enumValues>
    <name>Default</name>
  </enumValues>
  <enumValues>
    <name>Folder</name>
  </enumValues>
  <enumValues>
    <name>Media</name>
  </enumValues>
  <enumValues>
    <name>Image</name>
  </enumValues>
  <enumValues>
    <name>Video</name>
  </enumValues>
  <enumValues>
    <name>Audio</name>
  </enumValues>
  <enumValues>
    <name>Document</name>
  </enumValues>
  <enumValues>
    <name>DataProcessor</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Catalogs/СводыЗнанийСУЗ/СводыЗнанийСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СводыЗнанийСУЗ</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>РуководствоПользователя</name>
      <description>Руководство пользователя</description>
    </items>
  </predefined>
  <attributes>
    <name>Версия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Карта</name>
    <type>
      <types>CatalogRef.КартыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Редакция</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтартоваяСтраница</name>
    <type>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.КартыСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПоследнююВерсию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредпочитатьПоставщика</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыЭлектронныхРесурсовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоследовательнаяНавигация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрытьСодержание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Глоссарий</name>
    <type>
      <types>CatalogRef.ГлоссарииСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СправочнаяИнформация</name>
    <type>
      <types>CatalogRef.СтраницыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Базовый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПервуюСсылкуНаТермин</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьТерминВсплывающейПодсказкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БлокироватьНепройденное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПользовательскиеНастройки</name>
    <attributes>
      <name>ВидНастройки</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыНастроекЭлектронныхРесурсовСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СкрытыеРесурсы</name>
    <attributes>
      <name>Ресурс</name>
      <type>
        <types>CatalogRef.ПодборкиСУЗ</types>
        <types>CatalogRef.ФреймыСУЗ</types>
        <types>CatalogRef.СтраницыСУЗ</types>
        <types>CatalogRef.ГлоссарииСУЗ</types>
        <types>CatalogRef.РесурсыСУЗ</types>
        <types>CatalogRef.СводыЗнанийСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыгружатьПриОткрытии</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьГруппыПодчиненныхЭлементов</name>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.ПодборкиСУЗ</types>
        <types>CatalogRef.ФреймыСУЗ</types>
        <types>CatalogRef.ТерминыСУЗ</types>
        <types>CatalogRef.СтраницыСУЗ</types>
        <types>CatalogRef.ГлоссарииСУЗ</types>
        <types>CatalogRef.РесурсыСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Catalogs/РесурсыСУЗ/РесурсыСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РесурсыСУЗ</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Общие</name>
      <description>Общие</description>
    </items>
    <items>
      <name>Служебные</name>
      <description>Служебные</description>
    </items>
  </predefined>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентичныйРесурс</name>
    <comment>Важно! Данный реквизит должен стоять перед реквизитом ФайлЗапуска, так как при экспорте необходимо сначала зарегистрировать идентичный ресурс, а потом файл, иначе ресурс будет экспортирован не полностью.</comment>
    <type>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлЗапуска</name>
    <type>
      <types>CatalogRef.ФайлыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыЗапуска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЯкорьЗапуска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SCO</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Интерактивный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодключитьAPI</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдинственныйФайл</name>
    <type>
      <types>CatalogRef.ФайлыСУЗ</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/Catalogs/ФайлыСУЗ/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	

#Область ПрограммныйИнтерфейс

// ПРОГРАММНЫЙ ИНТЕРФЕЙС

Функция ТипОбъектаСУЗ() Экспорт
	
	Возврат Перечисления.ТипыОбъектовСУЗ.file;
	
КонецФункции

// Позволяет получить XML данные объекта.
//
// Параметры
//  ОбъектСУЗ          - экземпляр обработки ОбъектСУЗ.
//  ПараметрыСсылки    – Структура, содержит параметры ссылки по которой вызывается вопрос.
//  КонтекстВыполнения - Структура, содержит параметры контекста выполнения объекта.
//
// Возвращаемое значение:
//   Строка – содержит XML представление объекта СУЗ.
//
Функция ПолучитьXMLПредставление(Файл, ПараметрыСсылки, КонтекстВыполнения) Экспорт
	
	ДанныеФайла = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Файл, "Владелец, ТипФайла, ИмяФайла, ОткрыватьПоСсылке, Наименование, FlashВерсия, FlashЦветФона, Выравнивать, Высота, Ширина, ОткрыватьПоСсылке, ОткрыватьВнешнимПриложением, ПроигрыватьАвтоматически, ВнешнийФайл");
	
	Если НЕ ДанныеФайла.ВнешнийФайл Тогда
		ДанныеФайла.ИмяФайла = Справочники.ФайлыСУЗ.ИмяФайлаДляВыгрузки(Файл, ДанныеФайла.ИмяФайла, ДанныеФайла.ТипФайла, КонтекстВыполнения.ПараметрыЭкспорта);
	КонецЕсли;
	
	// Примечание: добавление владельца к списку ресурсов необходимо, так как файл может
	// быть вставлен отдельно без ресурса, но для его отображения необходимы все файлы ресурса.
	ОбъектыСУЗ.ДобавитьРесурсВМассивРесурсов(ДанныеФайла.Владелец, КонтекстВыполнения.СписокРесурсов);
	
	ИдентификаторСводаЗнаний = Справочники.СводыЗнанийСУЗ.ИдентификаторКаталога(КонтекстВыполнения.ЭлектронныйРесурс);
	ИмяОбъектаСУЗ            = ОбщегоНазначенияСУ.ИмяЗначенияПеречисления(ТипОбъектаСУЗ());
	ИмяТипаФайла             = ОбщегоНазначенияСУ.ИмяЗначенияПеречисления(ДанныеФайла.ТипФайла);
	ОбъектЗапуска            = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(ПараметрыСсылки, "object");
	ПараметрыЗапуска         = Строка(ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(ПараметрыСсылки, "ПараметрыЗапуска"));
	ПоставщикСводаЗнаний     = Справочники.СводыЗнанийСУЗ.Поставщик(КонтекстВыполнения.ЭлектронныйРесурс);
	
	Если ОбъектЗапуска = "file" И ДанныеФайла.ТипФайла <> Перечисления.ТипыФайловСУЗ.DataProcessor Тогда
		
		// Если файл запускается из свода знаний непосредственно,
		// То есть не вложен в другой объект (подборку или ресурс),
		// То отображаем его всегда во фрейме.
		
		ЗапускатьВоФрейме = Истина;
		
	ИначеЕсли КонтекстВыполнения.Свойство("ВозможноПоказатьОдинФайл") И ДанныеФайла.ТипФайла = Перечисления.ТипыФайловСУЗ.Document Тогда
		
		ЗапускатьВоФрейме = Истина;
		
	Иначе
		
		// Если файл вложен в другой объект, то этот объект сам решает можно ли
		// Отобразить файл во фрейме и передает эту информацию через параметр
		// "ЗапускатьВоФрейме" контекста выполнения.
		
		Если КонтекстВыполнения.Свойство("ЗапускатьВоФрейме") И НЕ ДанныеФайла.ОткрыватьПоСсылке Тогда
			ЗапускатьВоФрейме = КонтекстВыполнения.ЗапускатьВоФрейме; 			
		Иначе
			ЗапускатьВоФрейме = Ложь;
		КонецЕсли;
		
	КонецЕсли;		
	
	Если КонтекстВыполнения.Свойство("ВозможноПоказатьОдинФайл") И НЕ ЗапускатьВоФрейме И (ДанныеФайла.ТипФайла = Перечисления.ТипыФайловСУЗ.Default ИЛИ ДанныеФайла.ТипФайла = Перечисления.ТипыФайловСУЗ.DataProcessor) Тогда
		КонтекстВыполнения.ВозможноПоказатьОдинФайл = Ложь; // Чтобы были поля при отображении ссылки на файл
	КонецЕсли;	
	
	АльтернативныйТекст = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(ПараметрыСсылки, "alt");
	
	Если ПустаяСтрока(АльтернативныйТекст) Тогда
		АльтернативныйТекст = ДанныеФайла.Наименование;
	КонецЕсли;
	
	Если КонтекстВыполнения.Свойство("СтатичноеПредставление") И КонтекстВыполнения.СтатичноеПредставление Тогда
		СтатичноеПредставление = Истина;
	Иначе
		СтатичноеПредставление = Ложь;
	КонецЕсли;
	
	// Определяем путь к файлу
	
	ОтносительныйПутьКФайлу = ПолучитьОтносительныйПутьКФайлу(Файл, КонтекстВыполнения.ПараметрыЭкспорта);
	ПолныйПутьКФайлу        = ПолучитьПолныйПутьКФайлу(Файл, ОтносительныйПутьКФайлу, ИдентификаторСводаЗнаний, КонтекстВыполнения);
	
	Если ПараметрыСеанса.ИспользуетсяЛокальныйКэшНаКлиентеСУЗ И КонтекстВыполнения.ПараметрыЭкспорта = Неопределено И НЕ ДанныеФайла.ВнешнийФайл Тогда
		ПолныйПутьКФайлу = "file://" + ПолныйПутьКФайлу;
	КонецЕсли;
	
	// Формируем XML
	
	ФайлXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/File","Файл");
	ФайлXDTO     = ФабрикаXDTO.Создать(ФайлXDTOТип);
	
	ФайлXDTO.object                = ИмяОбъектаСУЗ;
	ФайлXDTO.id                    = Файл.УникальныйИдентификатор();
	ФайлXDTO.Тип                   = ИмяТипаФайла;
	ФайлXDTO.Путь                  = ПолныйПутьКФайлу;
	ФайлXDTO.ОтносительныйПуть     = ОтносительныйПутьКФайлу;
	ФайлXDTO.Якорь                 = Строка(ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(ПараметрыСсылки, "anchor"));
	ФайлXDTO.ПараметрыЗапуска      = ПараметрыЗапуска;
	ФайлXDTO.Каталог               = Лев(ОтносительныйПутьКФайлу, СтрДлина(ОтносительныйПутьКФайлу)-СтрДлина(ДанныеФайла.ИмяФайла));
	ФайлXDTO.Расширение            = НРег(ОбщегоНазначенияКлиентСервер.ПолучитьРасширениеИмениФайла(ДанныеФайла.ИмяФайла));
	ФайлXDTO.РежимЭкспорта         = ?(КонтекстВыполнения.ПараметрыЭкспорта = Неопределено, Ложь, Истина);
	ФайлXDTO.ПодключитьAPI         = КонтекстВыполнения.ПодключитьAPI;	
	ФайлXDTO.МожноОтключитьFlash   = МожноОтключитьFlash(КонтекстВыполнения, ФайлXDTO.Расширение);
	ФайлXDTO.ИдентификаторYouTube  = "";
	
	Если ДанныеФайла.ВнешнийФайл И Файл.ТипФайла = Перечисления.ТипыФайловСУЗ.Video Тогда		
		ИдентификаторYouTube = ОбъектыСУЗКлиентСервер.ИдентификаторВидеоYouTubeИзURI(ФайлXDTO.ОтносительныйПуть);
		Если ЗначениеЗаполнено(ИдентификаторYouTube) Тогда
			Если ФайлXDTO.МожноОтключитьFlash ИЛИ КонтекстВыполнения.ПараметрыЭкспорта <> Неопределено Тогда
				ФайлXDTO.ИдентификаторYouTube = ИдентификаторYouTube;
			Иначе
				ФайлXDTO.Тип = ОбщегоНазначенияСУ.ИмяЗначенияПеречисления(Перечисления.ТипыФайловСУЗ.Default);
			КонецЕсли;
		КонецЕсли;		
	КонецЕсли;
	
	ВладелецXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/KnowledgeSources","ОбъектСУЗ");
	ВладелецXDTO    = ФабрикаXDTO.Создать(ВладелецXDTOТип);
	ВладелецXDTO.id = ДанныеФайла.Владелец.УникальныйИдентификатор();
	
	ФайлXDTO.Владелец = ВладелецXDTO;
	
	НастройкиXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/File", "Представление");
	НастройкиXDTO    = ФабрикаXDTO.Создать(НастройкиXDTOТип);
	
	НастройкиXDTO.Ширина                      = ДанныеФайла.Ширина;
	НастройкиXDTO.Высота                      = ДанныеФайла.Высота;
	НастройкиXDTO.Выравнивание                = ОбщегоНазначенияСУ.ИмяЗначенияПеречисления(ДанныеФайла.Выравнивать); 
	НастройкиXDTO.ЦветФона                    = ДанныеФайла.FlashЦветФона;
	НастройкиXDTO.ВерсияПлагина               = ДанныеФайла.FlashВерсия;
	НастройкиXDTO.ИдентификаторОбластиДанных  = "file_" + СтрЗаменить(ФайлXDTO.id, "-", "");
	НастройкиXDTO.СтатичноеПредставление      = СтатичноеПредставление;
	НастройкиXDTO.АльтернативныйТекст         = АльтернативныйТекст;
	НастройкиXDTO.ЗапускатьВоФрейме           = ЗапускатьВоФрейме;
	НастройкиXDTO.ОдинФайл                    = ?(КонтекстВыполнения.Свойство("ВозможноПоказатьОдинФайл") И КонтекстВыполнения.ВозможноПоказатьОдинФайл, Истина, Ложь);
	НастройкиXDTO.ПроигрыватьАвтоматически    = ДанныеФайла.ПроигрыватьАвтоматически;
	НастройкиXDTO.ОткрыватьВнешнимПриложением = ДанныеФайла.ОткрыватьВнешнимПриложением;
    НастройкиXDTO.ОткрыватьПоСсылке           = ?(ОбъектЗапуска = "file", Ложь, ДанныеФайла.ОткрыватьПоСсылке);
	
	Если Файл.ТипФайла = Перечисления.ТипыФайловСУЗ.Video
		И ЕстьМиниатюра(Файл) Тогда
		
		НастройкиXDTO.ПутьКМиниатюре = ИмяФайлаМиниатюры(ПолныйПутьКФайлу);
		
	КонецЕсли;
	
	ФайлXDTO.Настройки = НастройкиXDTO;
	
	// Добавляем модули
	
	Если ДанныеФайла.ТипФайла = Перечисления.ТипыФайловСУЗ.Document Тогда
		// Модуль подсказок всегда подключается к документам
		ОбъектыСУЗ.ДобавитьМодульВМассив("qtip2", КонтекстВыполнения.СписокМодулей);
	КонецЕсли;
	
	// Формируем XML
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ФайлXDTO);
	XMLДанные = ЗаписьXML.Закрыть();
	
	ШаблонОбъекта = ОбъектыСУЗ.ПолучитьСсылкуНаXSLШаблонОбъекта(Файл);
	ОбъектыСУЗ.ДобавитьШаблонВСписокОбъекта(ШаблонОбъекта, КонтекстВыполнения.СписокШаблонов);
	
	Возврат XMLДанные;
	
КонецФункции

Функция МожноОтключитьFlash(КонтекстВыполнения, Расширение = Неопределено) Экспорт
	
	ИспользуетсяСовременныйБраузерВоВсехСлучаях = ОбъектыСУЗПовтИсп.ИспользуетсяСовременныйБраузерВоВсехСлучаях();
	
	ЭтоСтандартноеВидеоАудиоВВебКлиенте = (
		(Расширение = "mp4"
		ИЛИ Расширение = "webm"
		ИЛИ Расширение = "mp3"
		ИЛИ Расширение = Неопределено)
		И СтандартныеПодсистемыСервер.ПараметрыКлиентаНаСервере().Получить("ЭтоВебКлиент"));
										
	ЭтоВстроенныйWeKit = (КонтекстВыполнения.Свойство("ЭтоВстроенныйWeKit") И КонтекстВыполнения.ЭтоВстроенныйWeKit = Истина);
										
	Возврат (ИспользуетсяСовременныйБраузерВоВсехСлучаях ИЛИ ЭтоСтандартноеВидеоАудиоВВебКлиенте ИЛИ ЭтоВстроенныйWeKit);
	
КонецФункции

// Функция возвращает путь к файлу относительно каталога ресурсов.
//
Функция ПолучитьОтносительныйПутьКФайлу(Файл, ПараметрыЭкспорта=Неопределено) Экспорт
	
	Если Файл.ВнешнийФайл Тогда
		Возврат Файл.ИмяФайла;
	КонецЕсли;
	     
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ФайлыСУЗ.Ссылка КАК Ссылка,
	               |	ФайлыСУЗ.ИмяФайла КАК ИмяФайла,
	               |	ФайлыСУЗ.ТипФайла,
	               |	ФайлыСУЗ.ВнешнийФайл
	               |ИЗ
	               |	Справочник.ФайлыСУЗ КАК ФайлыСУЗ
	               |ГДЕ
	               |	ФайлыСУЗ.Ссылка = &Ссылка
	               |ИТОГИ ПО
	               |	Ссылка ТОЛЬКО ИЕРАРХИЯ";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", Файл);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	// Относительный путь к файлу включает и каталог ресурса этого файла.
	СсылкаНаФайл = Справочники.РесурсыСУЗ.ИмяКаталогаРесурса(Файл.Владелец);
	
	Если ЗначениеЗаполнено(СсылкаНаФайл) Тогда
		СсылкаНаФайл = СсылкаНаФайл +  "/";
	КонецЕсли;
	
	Пока Результат.Следующий() Цикл		
		Если НЕ ПустаяСтрока(Результат.ИмяФайла) Тогда
			СсылкаНаФайл = СсылкаНаФайл + Справочники.ФайлыСУЗ.ИмяФайлаДляВыгрузки(Результат.Ссылка, Результат.ИмяФайла, Результат.ТипФайла, ПараметрыЭкспорта) + "/";
		КонецЕсли;
	КонецЦикла;
	
	СсылкаНаФайл = Сред(СсылкаНаФайл, 1, СтрДлина(СсылкаНаФайл)-1); // Убираем последний слэш
	
	Возврат СсылкаНаФайл;   
	
КонецФункции

Функция ПолучитьПолныйПутьКФайлу(Файл, ОтносительныйПутьКФайлу, ИдентификаторСводаЗнаний, КонтекстВыполнения) Экспорт
	
	Если КонтекстВыполнения.ПараметрыЭкспорта <> Неопределено
		ИЛИ (Файл.ВнешнийФайл И Найти( ОтносительныйПутьКФайлу, "://") > 0) Тогда
		
		ПолныйПутьКФайлу = ОтносительныйПутьКФайлу;
		
	Иначе
		
		ПолныйПутьКФайлу = Справочники.РесурсыСУЗ.АдресКаталогаРесурсов(ИдентификаторСводаЗнаний) + ОтносительныйПутьКФайлу;
		ПолныйПутьКФайлу = ОбщегоНазначенияСУКлиентСервер.ПривестиСлэши(ПолныйПутьКФайлу);
		
	КонецЕсли;
	
	Возврат ПолныйПутьКФайлу;
	
КонецФункции

// Изменяет имя файла, если необходимо.
// Примечание: необходимо обеспечить, чтобы функция не вызывалась
// для внешних файлов, так как это не имеет смысла.
//
Функция ИмяФайлаДляВыгрузки(Знач Файл, Знач ИмяФайла, Знач ТипФайла, ПараметрыЭкспорта = Неопределено) Экспорт

	// Заменяем русские символы в имени файлы на английские (только для экспорта)
	
	ТребуетсяЗаменитьРусскиеСимволы = Ложь;
	
	Если ПараметрыЭкспорта <> Неопределено Тогда
				
		ТребуемыеДанныеРесурса = Новый Структура("ФайлЗапуска, ИмяФайлаЗапуска", "Владелец.ФайлЗапуска", "Владелец.ФайлЗапуска.ИмяФайла");
		ДанныеРесурса = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Файл, ТребуемыеДанныеРесурса);		
		РасширениеИмени = ОбщегоНазначенияКлиентСервер.ПолучитьРасширениеИмениФайла(ДанныеРесурса.ИмяФайлаЗапуска);
				
		Если ЗначениеЗаполнено(ДанныеРесурса.ФайлЗапуска) 
			И РазработкаЭлектронныхКурсовСлужебныйКлиентСервер.ЭтоФайлHTML(РасширениеИмени) Тогда
			ТребуетсяЗаменитьРусскиеСимволы = Ложь;
		Иначе
			ТребуетсяЗаменитьРусскиеСимволы = Истина;	
		КонецЕсли;
				
	КонецЕсли;
	
	Если ТребуетсяЗаменитьРусскиеСимволы Тогда
	
		СписокСимволов = Новый СписокЗначений;
		СписокСимволов.Добавить("а","A");
		СписокСимволов.Добавить("б","B");
		СписокСимволов.Добавить("в","V");
		СписокСимволов.Добавить("г","G");
		СписокСимволов.Добавить("д","D");		
		СписокСимволов.Добавить("е","E");
		СписокСимволов.Добавить("ё","EO");
		СписокСимволов.Добавить("ж","ZH");
		СписокСимволов.Добавить("з","Z");
		СписокСимволов.Добавить("и","I");
		СписокСимволов.Добавить("й","Y");
		СписокСимволов.Добавить("к","K");
		СписокСимволов.Добавить("л","L");
		СписокСимволов.Добавить("м","M");
		СписокСимволов.Добавить("н","N");
		СписокСимволов.Добавить("о","O");
		СписокСимволов.Добавить("п","P");
		СписокСимволов.Добавить("р","R");
		СписокСимволов.Добавить("с","S");
		СписокСимволов.Добавить("т","T");
		СписокСимволов.Добавить("у","U");
		СписокСимволов.Добавить("ф","F");
		СписокСимволов.Добавить("х","H");
		СписокСимволов.Добавить("ц","TS");
		СписокСимволов.Добавить("ч","CH");
		СписокСимволов.Добавить("ш","SH");
		СписокСимволов.Добавить("щ","SCH");
		СписокСимволов.Добавить("ь","");
		СписокСимволов.Добавить("ы","Y");
		СписокСимволов.Добавить("ъ","");
		СписокСимволов.Добавить("э","E");
		СписокСимволов.Добавить("ю","YU");
		СписокСимволов.Добавить("я","YA");
		
		СписокСимволов.Добавить("№","N");
		
		ИмяФайла = НРег(ИмяФайла);
		
		Для Каждого Строка Из СписокСимволов Цикл  
		    ИмяФайла = СтрЗаменить(ИмяФайла, Строка.Значение, НРег(Строка.Представление));
		КонецЦикла;
		
		Если Лев(ИмяФайла, 7) = "folder_" Тогда
			
			// Сокращаем имя папки, если это папка, созданная при загрузке файлов
			
			СвойстваФайла = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Файл, "ЭтоГруппа, Родитель, Владелец");
			
			Если СвойстваФайла.ЭтоГруппа Тогда
			
				СокращенноеИмя = Сред(ИмяФайла, 1, 6);
		
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	ФайлыСУЗ.Ссылка
					|ИЗ
					|	Справочник.ФайлыСУЗ КАК ФайлыСУЗ
					|ГДЕ
					|	ФайлыСУЗ.Ссылка <> &Файл
					|	И ФайлыСУЗ.ПометкаУдаления = ЛОЖЬ
					|	И ФайлыСУЗ.Владелец = &Ресурс
					|	И ФайлыСУЗ.Родитель = &Родитель
					|	И ФайлыСУЗ.ЭтоГруппа = ИСТИНА
					|	И ФайлыСУЗ.ИмяФайла = &СокращенноеИмяФайла";
				
				Запрос.УстановитьПараметр("Ресурс", СвойстваФайла.Владелец);
				Запрос.УстановитьПараметр("Родитель", СвойстваФайла.Родитель);
				Запрос.УстановитьПараметр("СокращенноеИмяФайла", СокращенноеИмя);
				Запрос.УстановитьПараметр("Файл", Файл);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				Если РезультатЗапроса.Пустой() Тогда
					ИмяФайла = СокращенноеИмя;				
				КонецЕсли;
				
			КонецЕсли;
				
		КонецЕсли;
		
	КонецЕсли;
	
	// Заменяем расширение
	
	Если ТипФайла = Перечисления.ТипыФайловСУЗ.Video Тогда
		
		БазовыйФормат = БазовыйФорматВидеоФайла(ИмяФайла);
		
		ПредпочтительныйФормат = ФорматВидеоФайлаДляОтображения(Файл, ИмяФайла, ПараметрыЭкспорта);
		
		Если ПредпочтительныйФормат <> БазовыйФормат Тогда			
			ИмяФайла = Лев(ИмяФайла, СтрДлина(ИмяФайла) - СтрДлина("."+БазовыйФормат)) + "." +НРег(ПредпочтительныйФормат);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипФайла = Перечисления.ТипыФайловСУЗ.Document Тогда
		РасширениеФайла = ОбщегоНазначенияКлиентСервер.ПолучитьРасширениеИмениФайла(ИмяФайла);
		ИмяФайла = Лев(ИмяФайла, СтрДлина(ИмяФайла) - СтрДлина("."+РасширениеФайла));
		Пока Прав(ИмяФайла, 1) = "." И СтрДлина(ИмяФайла) > 1 Цикл
			ИмяФайла = Лев(ИмяФайла, СтрДлина(ИмяФайла) - 1); // Если стоит две точки
		КонецЦикла;
	КонецЕсли;
	
	Возврат ИмяФайла;
	
КонецФункции

Функция ФорматыВидеоФайлов(Файл=Неопределено, Версия=Неопределено, Поставщик=Неопределено) Экспорт
	
	// Получаем таблицу видео файлов
	
	Если Файл = Неопределено Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ФайлыСУЗ.Ссылка КАК Файл,
			|	ФайлыСУЗ.Поставщик,
			|	ФайлыСУЗ.Версия,
			|	ФайлыСУЗ.ИмяФайла
			|ИЗ
			|	Справочник.ФайлыСУЗ КАК ФайлыСУЗ
			|ГДЕ
			|	ФайлыСУЗ.ПометкаУдаления = ЛОЖЬ
			|	И ФайлыСУЗ.ЭтоГруппа = ЛОЖЬ
			|	И ФайлыСУЗ.ТипФайла = ЗНАЧЕНИЕ(Перечисление.ТипыФайловСУЗ.Video)
			|	И ФайлыСУЗ.ВнешнийФайл = ЛОЖЬ";
		
		ТаблицаФайлов = Запрос.Выполнить().Выгрузить();
		
	Иначе
		
		ТаблицаФайлов = Новый ТаблицаЗначений;
		ТаблицаФайлов.Колонки.Добавить("Файл", Новый ОписаниеТипов("СправочникСсылка.ФайлыСУЗ"));
		ТаблицаФайлов.Колонки.Добавить("Версия", Новый ОписаниеТипов("Число"));
		ТаблицаФайлов.Колонки.Добавить("Поставщик", Новый ОписаниеТипов("СправочникСсылка.ПоставщикиСУЗ"));
		ТаблицаФайлов.Колонки.Добавить("ИмяФайла", Новый ОписаниеТипов("Строка"));
		
		НовыйФайл = ТаблицаФайлов.Добавить();
		НовыйФайл.Файл = Файл;
		НовыйФайл.Версия = Версия;
		НовыйФайл.Поставщик = Поставщик;
		НовыйФайл.ИмяФайла = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Файл, "ИмяФайла");
		
	КонецЕсли;
	
	// Выбираем форматы видео
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ВнешнийИсточник", ТаблицаФайлов);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Файлы.Файл,
	|	Файлы.Версия,
	|	Файлы.Поставщик
	|ПОМЕСТИТЬ ТаблицаФайлов
	|ИЗ
	|	&ВнешнийИсточник КАК Файлы
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Файл";
	
	Запрос.Выполнить();

	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеФайлыСУЗ.КодДанных,
		|	ТаблицаФайлов.Файл
		|ИЗ
		|	ТаблицаФайлов КАК ТаблицаФайлов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеФайлыСУЗ КАК ДанныеФайлыСУЗ
		|		ПО ТаблицаФайлов.Файл = ДанныеФайлыСУЗ.СсылкаНаОбъектСУЗ
		|			И ТаблицаФайлов.Поставщик = ДанныеФайлыСУЗ.Поставщик
		|			И ТаблицаФайлов.Версия = ДанныеФайлыСУЗ.Версия";
	
		
	ТаблицаФорматов = Запрос.Выполнить().Выгрузить();
	
	// Заполняем базовый формат
	
	ТаблицаФайлов.Колонки.Добавить("БазовыйФормат");
	
	Для каждого Строка Из ТаблицаФайлов Цикл	
		Строка.БазовыйФормат = БазовыйФорматВидеоФайла(Строка.ИмяФайла);
	КонецЦикла;		
	
	// Заполняем значения форматов
	
	ФорматыВидео = ДоступныеФорматыВидео();
	
	Для каждого Формат Из ФорматыВидео Цикл	
		ТаблицаФайлов.Колонки.Добавить(Формат);	
	КонецЦикла;
	
	Для каждого Строка Из ТаблицаФайлов Цикл	
		
		ФорматыФайла = ТаблицаФорматов.НайтиСтроки(Новый Структура("Файл", Строка.Файл));
		
		Для каждого СтрокаФФ Из ФорматыФайла Цикл
			
			Если ФорматыВидео.Найти(СтрокаФФ.КодДанных) <> Неопределено Тогда
				Строка[СтрокаФФ.КодДанных] = Истина;
			КонецЕсли;
			
		КонецЦикла;	
		
	КонецЦикла;	
	
	//Возвращаем таблицу
	
	Возврат ТаблицаФайлов;		
		
КонецФункции

Функция ДоступныеФорматыВидео() Экспорт
	
	Возврат РазработкаСУЗКлиентСервер.ДоступныеФорматыВидео();
	
КонецФункции

Функция БазовыйФорматВидеоФайла(ИмяФайла) Экспорт
	Возврат ВРег(ОбщегоНазначенияКлиентСервер.ПолучитьРасширениеИмениФайла(ИмяФайла));
КонецФункции

Функция ФорматВидеоФайлаДляОтображения(Знач Файл, Знач ИмяФайла, ПараметрыЭкспорта=Неопределено) Экспорт
	
	БазовыйФормат = БазовыйФорматВидеоФайла(ИмяФайла);
	
	ДопФорматыФайла = РазработкаСУЗПовтИсп.ДополнительныеФорматыВидео(Файл);
	
	Если ДопФорматыФайла.Количество() = 0 Тогда
		Возврат БазовыйФормат;
	КонецЕсли;
	
	МассивФорматов = Новый Массив;
	
	Для каждого Строка Из ДопФорматыФайла Цикл	
		МассивФорматов.Добавить(Строка.Формат);	
	КонецЦикла;
	
	Если МассивФорматов.Найти(БазовыйФормат) = Неопределено Тогда
		МассивФорматов.Добавить(БазовыйФормат);
	КонецЕсли;
	
	Если ПараметрыЭкспорта = Неопределено Тогда 
		
		// Отображение в 1С
		
		Если МассивФорматов.Найти("MP4") <> Неопределено Тогда			
			Возврат "MP4";
		КонецЕсли;		
		
		Если МассивФорматов.Найти("FLV") <> Неопределено Тогда			
			Возврат "FLV";
		КонецЕсли;				
		
	Иначе
		
		// Публикация
		
		Если ПараметрыЭкспорта.Свойство("ФорматыВидео") И ПараметрыЭкспорта.ФорматыВидео <> Неопределено Тогда
			
			Для каждого Формат Из ПараметрыЭкспорта.ФорматыВидео Цикл
			
				Если МассивФорматов.Найти(Формат) <> Неопределено Тогда			
					Возврат Формат;
				КонецЕсли;				
			
			КонецЦикла;
			
		КонецЕсли;	
	
		Если МассивФорматов.Найти("MP4") <> Неопределено Тогда			
			Возврат "MP4"; // Для отображения в экспорта лучше MP4
		КонецЕсли;
		
		Если МассивФорматов.Найти("WEBM") <> Неопределено Тогда			
			Возврат "WEBM";
		КонецЕсли;			
		
		Если МассивФорматов.Найти("FLV") <> Неопределено Тогда			
			Возврат "FLV";
		КонецЕсли;		
		
	КонецЕсли;	
		
	Возврат БазовыйФормат;
	
КонецФункции

Функция ЕстьМиниатюра(Файл) Экспорт
	
	Возврат ОбъектыСУЗ.ПолучитьДанные(Файл, "Миниатюра", Истина, "ТекстовыеДанные",,,Истина);
	
	// Реквизит ТекстовыеДанные указан, чтобы не выбирались двоичные данные при проверке.
	// Нам нужно только узнать о наличии записи в регистре.
	
КонецФункции

Функция ИмяФайлаМиниатюры(ИмяФайла) Экспорт
	
	Возврат РазработкаСУЗКлиентСервер.ИмяФайлаМиниатюры(ИмяФайла);
	
КонецФункции

// Обновляет файл, если известно только его имя
//
Функция ОбновитьФайлРесурса(Ресурс, Имя, Наименование, ДвоичныеДанные, Описание, Расширение, Загрузка=Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФайлыСУЗ.Ссылка
		|ИЗ
		|	Справочник.ФайлыСУЗ КАК ФайлыСУЗ
		|ГДЕ
		|	ФайлыСУЗ.Владелец = &Ресурс
		|	И ФайлыСУЗ.ИмяФайла = &ИмяФайла";

	Запрос.УстановитьПараметр("ИмяФайла", Имя);
	Запрос.УстановитьПараметр("Ресурс", Ресурс);

	Результат = Запрос.Выполнить(); // Ищем файл в ресурсе

	Если Результат.Пустой() Тогда
		
		ФайлРесурсаОбъект = Справочники.ФайлыСУЗ.СоздатьЭлемент();
		
	Иначе
		
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		
		ФайлРесурсаОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		
	КонецЕсли;
	
	ФайлРесурсаОбъект.Наименование = Наименование;
	ФайлРесурсаОбъект.Владелец     = Ресурс;
	
	РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(ФайлРесурсаОбъект);
	
	Если ФайлРесурсаОбъект.Ссылка.Пустая() Тогда
		ФайлРесурсаОбъект.Версия = 1;
	Иначе
		ПоследняяВерсия = ОбъектыСУЗ.ПолучитьПоследнююВерсию(ФайлРесурсаОбъект.Ссылка, ФайлРесурсаОбъект.Поставщик);
		Если ПоследняяВерсия.Поставщик = ФайлРесурсаОбъект.Поставщик Тогда 
			ФайлРесурсаОбъект.Версия = ПоследняяВерсия.Версия;
		Иначе
			ФайлРесурсаОбъект.Версия = 1;
		КонецЕсли;
	КонецЕсли;
	
	ФайлРесурсаОбъект.ИмяФайла = Имя;			
	ФайлРесурсаОбъект.ТипФайла = РазработкаСУЗКлиентСервер.ПолучитьТипФайлаПоРасширению(Расширение);
	
	ФайлРесурсаОбъект.ОбменДанными.Загрузка = Загрузка;
	
	ФайлРесурсаОбъект.Записать();
	
	РазработкаСУЗ.ЗаписатьДанныеВерсииОбъектаСУЗ(ФайлРесурсаОбъект, Описание, "Описание", "ТекстовыеДанные");
	
	РазработкаСУЗ.СохранитьДвоичныеДанныеФайла(ФайлРесурсаОбъект, ДвоичныеДанные);			
	
	Возврат ФайлРесурсаОбъект; // Для возможного продолжения записи
	
КонецФункции

#КонецОбласти


#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаОбъекта" Тогда		
		
		Ключ = Неопределено;
		ОткрытьФормуДокумента = Неопределено;		
		
		Параметры.Свойство("Ключ", Ключ);
		Параметры.Свойство("ОткрытьФормуДокумента", ОткрытьФормуДокумента);
		
		Если ЗначениеЗаполнено(Ключ) Тогда
			
			Если ОткрытьФормуДокумента = ИСТИНА Тогда
				
				СтандартнаяОбработка = Ложь;
				ВыбраннаяФорма = "Справочник.ФайлыСУЗ.Форма.ФормаДокумента";
				Возврат;
				
			Иначе
				
				ТипФайла = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ключ, "ТипФайла");
				
				Если ТипФайла = Перечисления.ТипыФайловСУЗ.Document Тогда
					СтандартнаяОбработка = Ложь;
					ВыбраннаяФорма = "Справочник.ФайлыСУЗ.Форма.ФормаДокумента";
					Возврат;					
				КонецЕсли;
				
			КонецЕсли;			
			
		Иначе
			
			Если ОткрытьФормуДокумента = ИСТИНА Тогда
				СтандартнаяОбработка = Ложь;
				ВыбраннаяФорма = "Справочник.ФайлыСУЗ.Форма.ФормаДокумента";
				Возврат;
			КонецЕсли;						
			
		КонецЕсли;
		
	КонецЕсли;
		
	
КонецПроцедуры


#КонецОбласти



#КонецЕсли
